# [05/08] 파이썬 7일차 실습예제

In [4]:
import pandas as pd

data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
          'year': [2000, 2001, 2002, 2001, 2002],
          'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = pd.DataFrame(data)
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                     index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [5]:
frame2.loc['one':'three','year':'pop']

       year state  pop
one    2000  Ohio  1.5
two    2001  Ohio  1.7
three  2002  Ohio  3.6

In [6]:
frame2.iloc[1:3,2:4]

       pop debt
two    1.7  NaN
three  3.6  NaN

In [7]:
frame2.iloc[2:4,2:]

       pop debt
three  3.6  NaN
four   2.4  NaN

In [8]:
frame2['three':'four'][['pop','debt']]

       pop debt
three  3.6  NaN
four   2.4  NaN

In [9]:
frame2.loc['three':'four','pop':'debt']

       pop debt
three  3.6  NaN
four   2.4  NaN

In [10]:
frame2[['pop','debt']]

       pop debt
one    1.5  NaN
two    1.7  NaN
three  3.6  NaN
four   2.4  NaN
five   2.9  NaN

In [ ]:
# 데이터프레임으로 읽어오기
path = './file/'
df = pd.read_csv(path+'ex01_csv.txt')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [17]:
# 열 이름과 인덱스 컬럼을 지정하여 읽어오기
names = ['a', 'b', 'c', 'd', 'message']
df = pd.read_csv(path+'ex02_csv.txt', names=names, index_col='message')
df

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [ ]:
# 멀티 인덱스 사용하여 읽어오기
df = pd.read_csv(path + 'ex03_multiindex_csv.txt',
                 index_col=['key1', 'key2'])
df

           val1  val2
key1 key2
one  a        1     2
     b        3     4
     c        5     6
     d        7     8
two  a        9    10
     b       11    12
     c       13    14
     d       15    16

In [ ]:
# 구분자가 공백문자인 경우
df = pd.read_csv(path+'ex04_space.txt', sep='\s+')
df

        a     b     c
aaa -0.12 -1.02 -0.61
bbb  0.90  0.33 -0.03
ccc -0.26 -0.38 -0.21
ddd -0.08 -0.30  1.10

In [23]:
# 예외 행 건너뛰기
df = pd.read_csv(path+'ex05_skip.txt', skiprows=[0, 2, 3])
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [24]:
# 열마다 다른 누락값 문자를 사전 값으로 넘겨주기
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}
pd.read_csv(path+'ex06_NA.txt', na_values=sentinels)

  something   a   b     c    d message
0       one   1   2   3.0    4     NaN
1       NaN   5   6   NaN    8   world
2    three9  10  11  12.0  foo     NaN

# file/voice 파일 읽어오기

In [53]:
import json
import os
import pandas as pd

path = "./file/voice/"
data_stt = {"file":[],'stt':[]}
data_thema = {'stt':[],'thema':[]}

for filename in os.listdir(path):
    full_path = path + filename
    with open(full_path, 'r', encoding='utf-8') as f:
        python_dict = json.load(f)  # 파일을 직접 load
        data_stt['stt'].append(python_dict['발화정보']['stt'])
        data_stt['file'].append(filename[:-5])
        data_thema['stt'].append(python_dict['발화정보']['stt'])
        data_thema['thema'].append(python_dict['대화정보']['convrsThema'])

# 데이터프레임 만들기
df_stt = pd.DataFrame(data_stt)
df_thema =  pd.DataFrame(data_thema)

In [52]:
# CSV 파일로 저장
df_stt.to_csv('./file/data_stt.csv', index=False, encoding='utf-8-sig')
df_thema.to_csv('./file/data_thema.csv', index=False, encoding='utf-8-sig')

# 클래스로 리팩토링

In [64]:
!pip install tabulate

Collecting tabulate
  Downloading tabulate-0.9.0-py3-none-any.whl.metadata (34 kB)
Downloading tabulate-0.9.0-py3-none-any.whl (35 kB)
Installing collected packages: tabulate
Successfully installed tabulate-0.9.0

[notice] A new release of pip is available: 25.1 -> 25.1.1
[notice] To update, run: C:\Users\user\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.11_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

In [ ]:
import os, json
import pandas as pd  # 데이터프레임 다루는 라이브러리 (CSV 저장 등)
from tabulate import tabulate  # 표 예쁘게 출력하는 라이브러리 추가

class VoiceData: 
    def __init__(self, path):
        self.path = path # 입력받는 멤버 변수

    def process_files(self):
        data_stt, data_thema = [], []
        
        for filename in os.listdir(self.path): # 폴더 안의 모든 파일 이름을 하나씩 순회
            with open(os.path.join(self.path, filename), 'r', encoding='utf-8') as f: # 파일 열기, 읽기 모드드
                data = json.load(f)  # 파일 내용을 JSON 형태로 읽어서 파싱
                stt = data['발화정보']['stt']  # 발화정보 안에서 stt 추출
                thema = data['대화정보']['convrsThema']  # 대화정보 안에서 convrsThema 추출
                data_stt.append({'file': filename[:-5], 'stt': stt})  # 파일이름(.json 제거)과 stt를 data_stt 리스트에 함께 한 줄씩씩
                data_thema.append({'stt': stt, 'thema': thema})  # stt와 thema를 함께 저장
        return pd.DataFrame(data_stt), pd.DataFrame(data_thema)  # 두 리스트를 각각 데이터프레임으로 변환하여 반환

    def save_to_csv(self, output_dir):
        df_stt, df_thema = self.process_files()  # 파일을 읽고 데이터프레임 2개 생성하여 df_stt, df_thema 변수에 저장
        df_stt.to_csv(os.path.join(output_dir, 'data_stt.csv'), index=False, encoding='utf-8-sig')  # stt 데이터를 CSV 형식으로 저장
        df_thema.to_csv(os.path.join(output_dir, 'data_thema.csv'), index=False, encoding='utf-8-sig')  # thema 데이터를 CSV 형식으로 저장

    def show_head(self): # 상위 5개 어느 정도 표 구조 유지하여 출력해 보기
        df_stt, df_thema = self.process_files()
        print(f"[STT 데이터 상위 5개]\n{tabulate(df_stt.head(), headers='keys', tablefmt='pretty')}\n\n[THEMA 데이터 상위 5개]\n{tabulate(df_thema.head(), headers='keys', tablefmt='pretty')}")

if __name__ == "__main__":  # 이 파일을 직접 실행할 때만 아래 코드 실행
    processor = VoiceData("./file/voice/")  # VoiceData 객체 생성, 경로 지정
    processor.save_to_csv('./file/')  # CSV 파일로 저장
    processor.show_head()

[STT 데이터 상위 5개]
+---+-------------------------------------------------------+------------------------------------------------------------------------------+
|   |                         file                          |                                     stt                                      |
+---+-------------------------------------------------------+------------------------------------------------------------------------------+
| 0 | 일반남여_일반통합06_F_1524374974_25_수도권_실내_06776 | 얼마 전에 아파트 인테리어를 새로 했는데 그때 베란다에 방수 시트를 깔았거든요 |
| 1 | 일반남여_일반통합06_F_1524374974_25_수도권_실내_06781 |          (NO:저희) 집은 북동향이라 햇빛이 잘 들어오는 편은 아니에요          |
| 2 | 일반남여_일반통합06_F_1524374974_25_수도권_실내_06782 |         다들 남향집을 찾는데 희한하게도 햇빛이 강한 집이 싫더라고요          |
| 3 | 일반남여_일반통합06_F_1524374974_25_수도권_실내_06794 |                흙은 그냥 아파트 앞에 있는 걸 퍼다 써도 될까요                |
| 4 | 일반남여_일반통합06_F_1524374974_25_수도권_실내_06800 |        왜요 화초는 보통 며칠 주기로 물을 충분히 주는게 좋다고 하던데         |
+---+-------------------------------------------------------+------------------------------------------------------------------------------+

[THEMA 데이터 상위 5개]
+---+------------------------------------------------------------------------------+----------------------+
|   |                                     stt                                      |        thema         |
+---+------------------------------------------------------------------------------+----------------------+
| 0 | 얼마 전에 아파트 인테리어를 새로 했는데 그때 베란다에 방수 시트를 깔았거든요 | 베란다에 텃밭 가꾸기 |
| 1 |          (NO:저희) 집은 북동향이라 햇빛이 잘 들어오는 편은 아니에요          | 베란다에 텃밭 가꾸기 |
| 2 |         다들 남향집을 찾는데 희한하게도 햇빛이 강한 집이 싫더라고요          | 베란다에 텃밭 가꾸기 |
| 3 |                흙은 그냥 아파트 앞에 있는 걸 퍼다 써도 될까요                | 베란다에 텃밭 가꾸기 |
| 4 |        왜요 화초는 보통 며칠 주기로 물을 충분히 주는게 좋다고 하던데         | 베란다에 텃밭 가꾸기 |
+---+------------------------------------------------------------------------------+----------------------+